app/views/restaurants/index.html.erb

SELECT  1 AS one FROM "reviews" WHERE "reviews"."restaurant_id" = $1 LIMIT $2  [["restaurant_id", 1], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."restaurant_id" = $1  [["restaurant_id", 1]]
---
    <%= image_tag restaurant.image.url(:thumb) %>
    <% if restaurant.reviews.any? %>

SELECT COUNT(*) FROM "endorsements" WHERE "endorsements"."review_id" = $1  [["review_id", 1]]
---
        <%= link_to "Endorse", review_endorsements_path(review), class: 'endorsements-link' %>
        <span class="endorsements_count"> <%= review.endorsements.count %> </span> <%= 'endorsement'.pluralize(review.endorsements.count) %>