app/controllers/restaurants_controller.rb

SELECT "restaurants".* FROM "restaurants"
---
  def index
    @restaurants = Restaurant.all

INSERT INTO "restaurants" ("name", "created_at", "updated_at", "description", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "KBN"], ["created_at", 2016-08-24 14:36:47 UTC], ["updated_at", 2016-08-24 14:36:47 UTC], ["description", "GOODD"], ["user_id", 1]]
---
  def create
    @restaurant = Restaurant.create(restaurant_params)

UPDATE "restaurants" SET "name" = $1, "description" = $2, "updated_at" = $3 WHERE "restaurants"."id" = $4  [["name", "Kentucky Fried Chicken"], ["description", "Deep fried goodness"], ["updated_at", 2016-08-25 10:12:17 UTC], ["id", 6]]
---
  def update
    find_current_restaurant
    if @restaurant.user == current_user
      @restaurant.update(restaurant_params)

DELETE FROM "restaurants" WHERE "restaurants"."id" = $1  [["id", 2]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]
---
  def destroy
    find_current_restaurant
    if @restaurant.user == current_user
      @restaurant.destroy

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def find_current_restaurant
    @restaurant = Restaurant.find(params[:id])