app/controllers/reviews_controller.rb

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def new
    @restaurant = Restaurant.find(params[:restaurant_id])

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "reviews" ("thoughts", "rating", "created_at", "updated_at", "restaurant_id", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["thoughts", "OHHH NOOO"], ["rating", 1], ["created_at", 2016-08-24 15:46:01 UTC], ["updated_at", 2016-08-24 15:46:01 UTC], ["restaurant_id", 5], ["user_id", 1]]
---
  def create
      @restaurant = Restaurant.find(params[:restaurant_id])
      @restaurant.reviews.create(review_params)